Ran Plan for 2 projects:

1. project: `development` dir: `deployment/dev/terraform` workspace: `default`
1. project: `production` dir: `deployment/prod/terraform` workspace: `default`

### 1. project: `development` dir: `deployment/dev/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
! resource "google_sql_database_instance" "default" {
        id                             = "backstage-dev"
        name                           = "backstage-dev"
        # (14 unchanged attributes hidden)

!       settings {
!           version                     = 26 -> 28
            # (12 unchanged attributes hidden)

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_secret_manager_secret.backstage-bits-credentials["pagerduty-client-id"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-dev"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-dev"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-dev"
+       secret_id             = "pagerduty-client-id"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-dev"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["pagerduty-client-secret"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-dev"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-dev"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-dev"
+       secret_id             = "pagerduty-client-secret"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-dev"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p development`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fdev%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p development`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. project: `production` dir: `deployment/prod/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.postgres.google_sql_database_instance.default has changed
! resource "google_sql_database_instance" "default" {
        id                             = "backstage-prod"
        name                           = "backstage-prod"
        # (14 unchanged attributes hidden)

!       settings {
!           version                     = 2 -> 4
            # (12 unchanged attributes hidden)

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_secret_manager_secret.backstage-bits-credentials["pagerduty-client-id"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "pagerduty-client-id"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["pagerduty-client-secret"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "pagerduty-client-secret"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "pagerduty"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p production`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fbackstage%252Fdeployment%252Fprod%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p production`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`